# Load and Prep Data

For each of the CSV in folder __src__:

 * Import as a dataframe.
 * Use function __summarise_dataframe__ to verify structure.
 * Select subset of columns for use in model (you can be very aggressive in culling columns here, in particular we are not going to perform and feature extraction using text, or spatial data.)
 * Fill in misssing values / nan with sane values (usually 0).
 * Save dataframe to __data__ for use in next step of pipeline.
 
 
![](https://kmurphy.bitbucket.io/modules/Data_Mining/topics/02-Feature_Engineering/21-Practical_03_-_Automatic_Feature_Engineering_-_Orders/files/Schema_model.png)

## Setup

In [1]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

sns.set(style="whitegrid")
from IPython.display import Markdown, display

In [2]:
import os
os.makedirs("data", exist_ok=True)

In [3]:
def summarise_dataframe(df):
    display(Markdown("\n**Dataframe (%s x %s)**\n" % df.shape), df.head())
    display(Markdown("\n**Missing Values**"), df.isna().sum())
    display(Markdown("\n**dtypes**"), df.dtypes)

## Foreach CSV ...

### customers

In [4]:
df_customers_full = pd.read_csv("src/customers.csv")
summarise_dataframe(df_customers_full)

df_customers = df_customers_full.loc[:,["customerNumber","country","salesRepEmployeeNumber","creditLimit"]]
df_customers.salesRepEmployeeNumber = df_customers.salesRepEmployeeNumber.replace(np.nan,0).astype(int)

summarise_dataframe(df_customers)
open("data/customers.csv","wt").write(df_customers.to_csv(index=False))

**Dataframe (122 x 13)**

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",NaN,Nantes,NaN,44000,France,1370.0,21000.0
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,NaN,Las Vegas,NV,83030,USA,1166.0,71800.0
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.0
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",NaN,Nantes,NaN,44000,France,1370.0,118200.0
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,NaN,Stavern,NaN,4110,Norway,1504.0,81700.0

**Missing Values**

customerNumber              0
customerName                0
contactLastName             0
contactFirstName            0
phone                       0
addressLine1                0
addressLine2              100
city                        0
state                      73
postalCode                  7
country                     0
salesRepEmployeeNumber     22
creditLimit                 0
dtype: int64

**dtypes**

customerNumber              int64
customerName               object
contactLastName            object
contactFirstName           object
phone                      object
addressLine1               object
addressLine2               object
city                       object
state                      object
postalCode                 object
country                    object
salesRepEmployeeNumber    float64
creditLimit               float64
dtype: object

**Dataframe (122 x 4)**

   customerNumber    country  salesRepEmployeeNumber  creditLimit
0             103     France                    1370      21000.0
1             112        USA                    1166      71800.0
2             114  Australia                    1611     117300.0
3             119     France                    1370     118200.0
4             121     Norway                    1504      81700.0

**Missing Values**

customerNumber            0
country                   0
salesRepEmployeeNumber    0
creditLimit               0
dtype: int64

**dtypes**

customerNumber              int64
country                    object
salesRepEmployeeNumber      int32
creditLimit               float64
dtype: object

2818

### offices

In [5]:
df_offices_full = pd.read_csv("src/offices.csv")
summarise_dataframe(df_offices_full)

df_offices = df_offices_full.loc[:,["officeCode","country","territory"]]
df_offices.territory = df_offices.territory.replace(np.nan,"USA").astype(object)

summarise_dataframe(df_offices)
open("data/offices.csv","wt").write(df_offices.to_csv(index=False))

**Dataframe (7 x 9)**

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NaN
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NaN
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NaN
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,NaN,NaN,France,75017,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,NaN,Chiyoda-Ku,Japan,102-8578,Japan

**Missing Values**

officeCode      0
city            0
phone           0
addressLine1    0
addressLine2    2
state           3
country         0
postalCode      0
territory       3
dtype: int64

**dtypes**

officeCode       int64
city            object
phone           object
addressLine1    object
addressLine2    object
state           object
country         object
postalCode      object
territory       object
dtype: object

**Dataframe (7 x 3)**

   officeCode country territory
0           1     USA       USA
1           2     USA       USA
2           3     USA       USA
3           4  France      EMEA
4           5   Japan     Japan

**Missing Values**

officeCode    0
country       0
territory     0
dtype: int64

**dtypes**

officeCode     int64
country       object
territory     object
dtype: object

114

### orders

In [6]:
df_orders_full = pd.read_csv("src/orders.csv")
summarise_dataframe(df_orders_full)

df_orders = df_orders_full.loc[:,["orderNumber","orderDate","requiredDate","shippedDate","status","customerNumber"]]
# df_orders.salesRepEmployeeNumber = df_orders.salesRepEmployeeNumber.replace(np.nan,0).astype(int)

summarise_dataframe(df_orders)
open("data/orders.csv","wt").write(df_orders.to_csv(index=False))

**Dataframe (326 x 7)**

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,NaN,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,NaN,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,NaN,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,NaN,141

**Missing Values**

orderNumber         0
orderDate           0
requiredDate        0
shippedDate        14
status              0
comments          246
customerNumber      0
dtype: int64

**dtypes**

orderNumber        int64
orderDate         object
requiredDate      object
shippedDate       object
status            object
comments          object
customerNumber     int64
dtype: object

**Dataframe (326 x 6)**

   orderNumber   orderDate requiredDate shippedDate   status  customerNumber
0        10100  2003-01-06   2003-01-13  2003-01-10  Shipped             363
1        10101  2003-01-09   2003-01-18  2003-01-11  Shipped             128
2        10102  2003-01-10   2003-01-18  2003-01-14  Shipped             181
3        10103  2003-01-29   2003-02-07  2003-02-02  Shipped             121
4        10104  2003-01-31   2003-02-09  2003-02-01  Shipped             141

**Missing Values**

orderNumber        0
orderDate          0
requiredDate       0
shippedDate       14
status             0
customerNumber     0
dtype: int64

**dtypes**

orderNumber        int64
orderDate         object
requiredDate      object
shippedDate       object
status            object
customerNumber     int64
dtype: object

16592

### productlines

In [7]:
df_productlines_full = pd.read_csv("src/productlines.csv")
summarise_dataframe(df_productlines_full)

df_productlines = df_productlines_full.loc[:,["productLine","textDescription"]]
# df_offices.salesRepEmployeeNumber = df_customers.salesRepEmployeeNumber.replace(np.nan,0).astype(int)

summarise_dataframe(df_productlines)
open("data/productlines.csv","wt").write(df_productlines.to_csv(index=False))

**Dataframe (7 x 4)**

,productLine,textDescription,htmlDescription,image
0,Classic Cars,Attention car enthusiasts: Make your wildest c...,NaN,NaN
1,Motorcycles,Our motorcycles are state of the art replicas ...,NaN,NaN
2,Planes,"Unique, diecast airplane and helicopter replic...",NaN,NaN
3,Ships,The perfect holiday or anniversary gift for ex...,NaN,NaN
4,Trains,Model trains are a rewarding hobby for enthusi...,NaN,NaN

**Missing Values**

productLine        0
textDescription    0
htmlDescription    7
image              7
dtype: int64

**dtypes**

productLine         object
textDescription     object
htmlDescription    float64
image              float64
dtype: object

**Dataframe (7 x 2)**

    productLine                                    textDescription
0  Classic Cars  Attention car enthusiasts: Make your wildest c...
1   Motorcycles  Our motorcycles are state of the art replicas ...
2        Planes  Unique, diecast airplane and helicopter replic...
3         Ships  The perfect holiday or anniversary gift for ex...
4        Trains  Model trains are a rewarding hobby for enthusi...

**Missing Values**

productLine        0
textDescription    0
dtype: int64

**dtypes**

productLine        object
textDescription    object
dtype: object

3410

### employees

In [8]:
df_employees_full = pd.read_csv("src/employees.csv")
summarise_dataframe(df_employees_full)

df_employees = df_employees_full.loc[:,["employeeNumber","reportsTo","jobTitle"]]
# df_offices.salesRepEmployeeNumber = df_customers.salesRepEmployeeNumber.replace(np.nan,0).astype(int)

summarise_dataframe(df_employees)
open("data/employees.csv","wt").write(df_employees.to_csv(index=False))

**Dataframe (23 x 8)**

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

**Missing Values**

employeeNumber    0
lastName          0
firstName         0
extension         0
email             0
officeCode        0
reportsTo         1
jobTitle          0
dtype: int64

**dtypes**

employeeNumber      int64
lastName           object
firstName          object
extension          object
email              object
officeCode          int64
reportsTo         float64
jobTitle           object
dtype: object

**Dataframe (23 x 3)**

   employeeNumber  reportsTo              jobTitle
0            1002        NaN             President
1            1056     1002.0              VP Sales
2            1076     1002.0          VP Marketing
3            1088     1056.0  Sales Manager (APAC)
4            1102     1056.0   Sale Manager (EMEA)

**Missing Values**

employeeNumber    0
reportsTo         1
jobTitle          0
dtype: int64

**dtypes**

employeeNumber      int64
reportsTo         float64
jobTitle           object
dtype: object

566

### orderdetails

In [9]:
df_orderdetails_full = pd.read_csv("src/orderdetails.csv")
summarise_dataframe(df_orderdetails_full)

df_orderdetails = df_orderdetails_full.loc[:,["orderNumber","productCode","quantityOrdered","priceEach","orderLineNumber"]]
# df_offices.salesRepEmployeeNumber = df_customers.salesRepEmployeeNumber.replace(np.nan,0).astype(int)

summarise_dataframe(df_orderdetails)
open("data/orderdetails.csv","wt").write(df_orderdetails.to_csv(index=False))

**Dataframe (2996 x 5)**

   orderNumber productCode  quantityOrdered  priceEach  orderLineNumber
0        10100    S18_1749               30     136.00                3
1        10100    S18_2248               50      55.09                2
2        10100    S18_4409               22      75.46                4
3        10100    S24_3969               49      35.29                1
4        10101    S18_2325               25     108.06                4

**Missing Values**

orderNumber        0
productCode        0
quantityOrdered    0
priceEach          0
orderLineNumber    0
dtype: int64

**dtypes**

orderNumber          int64
productCode         object
quantityOrdered      int64
priceEach          float64
orderLineNumber      int64
dtype: object

**Dataframe (2996 x 5)**

   orderNumber productCode  quantityOrdered  priceEach  orderLineNumber
0        10100    S18_1749               30     136.00                3
1        10100    S18_2248               50      55.09                2
2        10100    S18_4409               22      75.46                4
3        10100    S24_3969               49      35.29                1
4        10101    S18_2325               25     108.06                4

**Missing Values**

orderNumber        0
productCode        0
quantityOrdered    0
priceEach          0
orderLineNumber    0
dtype: int64

**dtypes**

orderNumber          int64
productCode         object
quantityOrdered      int64
priceEach          float64
orderLineNumber      int64
dtype: object

79703

### payments

In [10]:
df_payments_full = pd.read_csv("src/payments.csv")
summarise_dataframe(df_payments_full)

df_payments = df_payments_full.loc[:,["customerNumber","checkNumber","paymentDate","amount"]]
# df_offices.salesRepEmployeeNumber = df_customers.salesRepEmployeeNumber.replace(np.nan,0).astype(int)

summarise_dataframe(df_payments)
open("data/payments.csv","wt").write(df_payments.to_csv(index=False))

**Dataframe (273 x 4)**

   customerNumber checkNumber paymentDate    amount
0             103    HQ336336  2004-10-19   6066.78
1             103    JM555205  2003-06-05  14571.44
2             103    OM314933  2004-12-18   1676.14
3             112    BO864823  2004-12-17  14191.12
4             112     HQ55022  2003-06-06  32641.98

**Missing Values**

customerNumber    0
checkNumber       0
paymentDate       0
amount            0
dtype: int64

**dtypes**

customerNumber      int64
checkNumber        object
paymentDate        object
amount            float64
dtype: object

**Dataframe (273 x 4)**

   customerNumber checkNumber paymentDate    amount
0             103    HQ336336  2004-10-19   6066.78
1             103    JM555205  2003-06-05  14571.44
2             103    OM314933  2004-12-18   1676.14
3             112    BO864823  2004-12-17  14191.12
4             112     HQ55022  2003-06-06  32641.98

**Missing Values**

customerNumber    0
checkNumber       0
paymentDate       0
amount            0
dtype: int64

**dtypes**

customerNumber      int64
checkNumber        object
paymentDate        object
amount            float64
dtype: object

8968

### products

try:
    df_products_full = pd.read_csv("src/products.csv")
except pd.errors.ParseError as e:
    print(e)
    print("Fixing csv - saving output to src/products.csv")
    data = open("src/products.csv").read().replace('" ', "inch ")
    open("data/products_fix.csv")

In [12]:
df_products_full = pd.read_csv("src/products.csv")
summarise_dataframe(df_products_full)

df_products = df_products_full.loc[:,["productCode","productLine","productVendor","quantityInStock","buyPrice","MSRP"]]
# df_offices.salesRepEmployeeNumber = df_customers.salesRepEmployeeNumber.replace(np.nan,0).astype(int)

summarise_dataframe(df_products)
open("data/products.csv","wt").write(df_products.to_csv(index=False))

**Dataframe (229 x 21)**

,productCode,productName,productLine,productScale,productVendor,quantityInStock,buyPrice,MSRP,Unnamed: 8,Unnamed: 9,...,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,01:10,Min Lin Diecast,7933,48.81,95.7,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,01:10,Classic Metal Creations,7305,98.58,214.3,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,S10_2016,1996 Moto Guzzi 1100i,Motorcycles,01:10,Highway 66 Mini Classics,6625,68.99,118.94,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,S10_4698,2003 Harley-Davidson Eagle Drag Bike,Motorcycles,01:10,Red Start Diecast,5582,91.02,193.66,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,S10_4757,1972 Alfa Romeo GTA,Classic Cars,01:10,Motor City Art Classics,3252,85.68,136,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Missing Values**

productCode          2
productName          1
productLine          1
productScale         1
productVendor        2
quantityInStock      9
buyPrice            10
MSRP                10
Unnamed: 8         149
Unnamed: 9         169
Unnamed: 10        181
Unnamed: 11        189
Unnamed: 12        193
Unnamed: 13        214
Unnamed: 14        219
Unnamed: 15        220
Unnamed: 16        225
Unnamed: 17        226
Unnamed: 18        226
Unnamed: 19        227
Unnamed: 20        227
dtype: int64

**dtypes**

productCode         object
productName         object
productLine         object
productScale        object
productVendor       object
quantityInStock     object
buyPrice            object
MSRP                object
Unnamed: 8          object
Unnamed: 9          object
Unnamed: 10         object
Unnamed: 11         object
Unnamed: 12         object
Unnamed: 13         object
Unnamed: 14         object
Unnamed: 15         object
Unnamed: 16         object
Unnamed: 17         object
Unnamed: 18        float64
Unnamed: 19        float64
Unnamed: 20        float64
dtype: object

**Dataframe (229 x 6)**

,productCode,productLine,productVendor,quantityInStock,buyPrice,MSRP
0,S10_1678,Motorcycles,Min Lin Diecast,7933,48.81,95.7
1,S10_1949,Classic Cars,Classic Metal Creations,7305,98.58,214.3
2,S10_2016,Motorcycles,Highway 66 Mini Classics,6625,68.99,118.94
3,S10_4698,Motorcycles,Red Start Diecast,5582,91.02,193.66
4,S10_4757,Classic Cars,Motor City Art Classics,3252,85.68,136

**Missing Values**

productCode         2
productLine         1
productVendor       2
quantityInStock     9
buyPrice           10
MSRP               10
dtype: int64

**dtypes**

productCode        object
productLine        object
productVendor      object
quantityInStock    object
buyPrice           object
MSRP               object
dtype: object

18145